read_verilog ./mkPICAMTop.v
hierarchy -generate -libdir ${BLUESPEC}/lib/Verilog
flatten 
rename mkPICAMTop coralmw_mkPICAMInternal
synth -top coralmw_mkPICAMInternal
write_verilog coralmw_mkPICAMInternal.v