read_verilog ./mkPICAMTop.v
hierarchy -generate -libdir ${BLUESPEC}/lib/Verilog
flatten 
rename mkPICAMTop coralmw_mkPICAMTop
synth -top coralmw_mkPICAMTop
write_verilog coralmw_mkPICAMTop.v